dict = []
a = {"床位": 1, "姓名": "张小明", "药费": 4000, "检查费": 2000, "医保患者": "是", "押金": 5000}
b = {"床位": 2, "姓名": "李晓明", "药费": 3000, "检查费": 1200, "医保患者": "否", "押金": 10000}
c = {"床位": 3, "姓名": "王肖明", "药费": 2800, "检查费": 8000, "医保患者": "否", "押金": 10000}
dict.append(a)
dict.append(b)
dict.append(c)
if __name__ == '__main__':
    print("学号:2020328706   姓名:车明达")
    print(dict)
    for i in dict:
        print("{}床".format(i['床位']), end='')
        price = i["押金"] - i["检查费"] - i["药费"]
        if (price < 0):
            if (i["医保患者"] == '是'):
                print("{}已启动医保".format(i["姓名"]))
            else:
                print("{}已欠费，请通知患者及时缴费".format(i["姓名"]))
        else:
            print("{}无欠费".format(i["姓名"]))
